README.org
#+TITLE: Fonts for Apple platforms
#+AUTHOR: Hao Xiang Liew

* [[https://github.com/haoxiangliew/apple-fonts][apple-fonts]]

This repository contains all the system fonts obtained from [[https://developer.apple.com/fonts/]]

Most notably used in my [[https://github.com/haoxiangliew/nixos/blob/master/packages/apple-fonts/default.nix][nixos-configuration]]

** Updating
- Running ~./update.sh~ will fetch the latest packages from Apple and update the repository
- Via [[https://github.com/haoxiangliew/apple-fonts/blob/master/.github/workflows/main.yml][Github Actions]] the repository will fetch the latest fonts and update every month / workflow dispatch
